Revit 2027 API
ParameterTypeId.Profile1OffsetY Property
 "Vertical Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Profile1OffsetY { get; }
Public Shared ReadOnly Property Profile1OffsetY As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Profile1OffsetY {
	ForgeTypeId^ get ();
}
static member Profile1OffsetY : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace